Revit 2024 API
DisplacementElement.GetChildren Method
 Returns a set of DisplacementElements which have this DisplacementElement as a parent.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public IList<DisplacementElement> GetChildren()
Visual Basic
Public Function GetChildren As IList(Of DisplacementElement)
Visual C++
public:
IList<DisplacementElement^>^ GetChildren()
Return Value
 The returned array is sorted by element id.
See Also
DisplacementElement Class
Autodesk.Revit.DB Namespace